app/controllers/reports_controller.rb

  def index
    @reports = Report.all(:all, :order => 'date').reverse
---
SELECT * FROM "reports" ORDER BY date

  def show
    @report = Report.find(params[:id])
---
SELECT * FROM "reports" WHERE ("reports"."id" = 1)

  def edit
    @report = Report.find(params[:id])
---
SELECT * FROM "reports" WHERE ("reports"."id" = 5)

  def create
    @report = Report.new(params[:report])

    respond_to do |format|
      if @report.save
---
INSERT INTO "reports" ("deliveries_this_week", "updated_at", "date", "problems_and_issues", "genre", "upcoming_deliveries", "successes", "created_at") VALUES('<p>None</p>', '2009-07-10 12:47:23', '2009-07-10', '<p>Lazytown was not able to get Editorial sign-off in time for launch: postponed to next Wed.</p>

  def update
    @report = Report.find(params[:id])

    respond_to do |format|
      if @report.update_attributes(params[:report])
---
SELECT * FROM "reports" WHERE ("reports"."id" = 5)
UPDATE "reports" SET "problems_and_issues" = '<ul><li>Lazytown was not able to get Editorial sign-off in time for launch: postponed to next Wed.</li><li>Gamebuilder issue with requirement for pre-moderation of drawing tools not being communicated to indi or TPM until now.</li><li>Gamebuilder external Java developer starts next week -- there may be delays as we donnot want him working on the project while TPM is on vacation for 2 weeks.</li><li>Identity -- slow response from UX team in providing branding (logo) -- this is a constraint for development of Children''s Identity design.</li><li>Stickers -- still no delivery of a functional prototype.</li><li>New comm packs submitted with TX in October, but no FM&amp;T resources pending new staff are being recruited.</li></ul>', "deliveries_this_week" = '<ul><li>None</li></ul>', "successes" = '<ul><li>Serious Explorers mapping solution -- 3 week investigation into if and how we can use Sexy Maps has concluded.</li><li>Blue Peter requirements definition and budget estimates completed.</li><li>Cbeebies Barlesque redesign being ported to dev environment for site wide test phase.</li></ul>', "upcoming_deliveries" = '<ul><li>Lazytown -- postponed from today to next Wednesday due to pending Editorial sign-off and last ammends over-running.</li></ul>', "updated_at" = '2009-07-10 13:12:38' WHERE "id" = 14

  def destroy
    @report = Report.find(params[:id])
    @report.destroy
---
SELECT * FROM "reports" WHERE ("reports"."id" = 1)
DELETE FROM "reports" WHERE "id" = 1